In [3]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
import math
import scipy as sp
from statistics import mode

titanic_data=pd.read_csv(r'C:\Users\cruise\desktop\dataset\Titanic.csv')
titanic_data.head()

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0,3,Mr. Owen Harris Braund,male,22.0,1,0,7.2500
1,1,1,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0,71.2833
2,1,3,Miss. Laina Heikkinen,female,26.0,0,0,7.9250
3,1,1,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0,53.1000
4,0,3,Mr. William Henry Allen,male,35.0,0,0,8.0500

In [4]:
labels=['a','b','c']
data=[1,2,3]

In [5]:
pd.Series(data=data)

0    1
1    2
2    3
dtype: int64

In [6]:
pd.Series(data=data,index=labels)

a    1
b    2
c    3
dtype: int64

In [7]:
d={'a':1,'b':2}

In [8]:
pd.Series(d)

a    1
b    2
dtype: int64

In [10]:
ss=pd.Series([3,4,5],['a','b','c'])

In [11]:
ss

a    3
b    4
c    5
dtype: int64

In [13]:
 ss['b']

4

In [17]:
df=pd.DataFrame(np.random.randint(2,33,size=(3,3)),index=['a','b','c'],columns=['d','e','f'])

In [18]:
df

    d   e   f
a   5   6  13
b  15   5   6
c  10  22  12

In [19]:
df[['e','f']]

    e   f
a   6  13
b   5   6
c  22  12

In [20]:
df['new']=df['e']+df['f']

In [21]:
df

    d   e   f  new
a   5   6  13   19
b  15   5   6   11
c  10  22  12   34

In [23]:
df.loc['b']

d      15
e       5
f       6
new    11
Name: b, dtype: int32

In [26]:
df.iloc[1]

d      15
e       5
f       6
new    11
Name: b, dtype: int32

In [27]:
df.at['a','d']

5

In [34]:
df.iat[2,2]

12

In [30]:
df

    d   e   f  new
a   5   6  13   19
b  15   5   6   11
c  10  22  12   34

In [31]:
df>7

       d      e      f   new
a  False  False   True  True
b   True  False  False  True
c   True   True   True  True

In [32]:
df[df>7]

      d     e     f  new
a   NaN   NaN  13.0   19
b  15.0   NaN   NaN   11
c  10.0  22.0  12.0   34

In [37]:
df['e']>5

    d   e   f  new
a   5   6  13   19
c  10  22  12   34

In [38]:
df[df['e']>5]

    d   e   f  new
a   5   6  13   19
c  10  22  12   34

In [39]:
df[df['e']>5]['new']

a    19
c    34
Name: new, dtype: int32

In [40]:
df

    d   e   f  new
a   5   6  13   19
b  15   5   6   11
c  10  22  12   34

In [44]:
df[(df['d']>4) & (df['f']>6)]

    d   e   f  new
a   5   6  13   19
c  10  22  12   34

In [45]:
df.reset_index()

  index   d   e   f  new
0     a   5   6  13   19
1     b  15   5   6   11
2     c  10  22  12   34

In [47]:
df.set_index('e')

     d   f  new
e
6    5  13   19
5   15   6   11
22  10  12   34

In [49]:
df.pivot_table(values='new',index='d',columns='f')

f     6     12    13
d
5    NaN   NaN  19.0
10   NaN  34.0   NaN
15  11.0   NaN   NaN

In [52]:
df.duplicated().any()

False

In [53]:
fuel=pd.read_csv(r'https://raw.githubusercontent.com/WalePhenomenon/climate_change/master/fuel_ferc1.csv')

In [54]:
fuel.head()

,record_id,utility_id_ferc1,report_year,plant_name_ferc1,fuel_type_code_pudl,fuel_unit,fuel_qty_burned,fuel_mmbtu_per_unit,fuel_cost_per_unit_burned,fuel_cost_per_unit_delivered,fuel_cost_per_mmbtu
0,f1_fuel_1994_12_1_0_7,1,1994,rockport,coal,ton,5377489.0,16.590,18.59,18.53,1.121
1,f1_fuel_1994_12_1_0_10,1,1994,rockport total plant,coal,ton,10486945.0,16.592,18.58,18.53,1.120
2,f1_fuel_1994_12_2_0_1,2,1994,gorgas,coal,ton,2978683.0,24.130,39.72,38.12,1.650
3,f1_fuel_1994_12_2_0_7,2,1994,barry,coal,ton,3739484.0,23.950,47.21,45.99,1.970
4,f1_fuel_1994_12_2_0_10,2,1994,chickasaw,gas,mcf,40533.0,1.000,2.77,2.77,2.570

In [56]:
fuel.info("")

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29523 entries, 0 to 29522
Data columns (total 11 columns):
record_id                       29523 non-null object
utility_id_ferc1                29523 non-null int64
report_year                     29523 non-null int64
plant_name_ferc1                29523 non-null object
fuel_type_code_pudl             29523 non-null object
fuel_unit                       29343 non-null object
fuel_qty_burned                 29523 non-null float64
fuel_mmbtu_per_unit             29523 non-null float64
fuel_cost_per_unit_burned       29523 non-null float64
fuel_cost_per_unit_delivered    29523 non-null float64
fuel_cost_per_mmbtu             29523 non-null float64
dtypes: float64(5), int64(2), object(4)
memory usage: 2.5+ MB